# GIT - это распределенная система контроля версий
# Это система для отслеживания и ведения истории изменения файлов в нашем проекте. При помощи git можно организвть командную работу.

# GitHub - это веб-сайт для размещения git-репозиториев в совместной разработке проектов.

# Репозиторий - это хванилище нашего кода и истории его изменений

# Команды GIT:
# 1. git init - создает удаленный репозиторий, в той директории, в которой была прописанна команда
# 2. git add . - это команда для добавления изменений в систему отслеживания гита. (вместо точки можно добавить название директории)
# 3. git commit -m 'какой-то комментарий типа Ажара ляляля' - это команда для сохранения всех изменений с комментарием к ним.
# 4. git branch -M main - это команда переименовывает главнуб ветку master на main.
# 5. git remote add origin 'url' - эта команда связывает наш локальный репозиторий с удаленным репозиторием на ГитХабе.
# 6. git puch origin <main> - команда отправки наших изменений на удаленный репозиторий.

# =========================================================================================================
# git status - показывает статус репозитория (какие изменения не закомичены)
# git branch - показывает на какой ветке находитесь.
